In [1]:
#数据清洗与规整
import numpy as np
import pandas as pd
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [2]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [3]:
string_data[0] = None

In [4]:
  string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [5]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
 data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])

In [8]:
cleaned = data.dropna()

In [9]:
 data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
 cleaned

     0    1    2
0  1.0  6.5  3.0

In [11]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data[4] = NA

In [13]:
 data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [14]:
data[0]

0    1.0
1    1.0
2    NaN
3    NaN
Name: 0, dtype: float64

In [15]:
data[0:2]

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN

In [16]:
df = pd.DataFrame(np.random.randn(7, 3))

In [17]:
df.iloc[:4, 1] = NA

In [18]:
df.iloc[:2, 2] = NA

In [19]:
df

          0         1         2
0  1.951586       NaN       NaN
1 -1.679193       NaN       NaN
2  0.225144       NaN -1.313239
3  0.218700       NaN -1.078544
4 -0.988566 -0.101289 -1.242995
5  1.070463 -1.303397  0.054561
6 -0.274731 -0.724751 -0.888987

In [20]:
df.dropna()

          0         1         2
4 -0.988566 -0.101289 -1.242995
5  1.070463 -1.303397  0.054561
6 -0.274731 -0.724751 -0.888987

In [21]:
df.dropna(thresh=2)

          0         1         2
2  0.225144       NaN -1.313239
3  0.218700       NaN -1.078544
4 -0.988566 -0.101289 -1.242995
5  1.070463 -1.303397  0.054561
6 -0.274731 -0.724751 -0.888987

In [22]:
df.fillna(0)

          0         1         2
0  1.951586  0.000000  0.000000
1 -1.679193  0.000000  0.000000
2  0.225144  0.000000 -1.313239
3  0.218700  0.000000 -1.078544
4 -0.988566 -0.101289 -1.242995
5  1.070463 -1.303397  0.054561
6 -0.274731 -0.724751 -0.888987

In [23]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  1.951586  0.500000  0.000000
1 -1.679193  0.500000  0.000000
2  0.225144  0.500000 -1.313239
3  0.218700  0.500000 -1.078544
4 -0.988566 -0.101289 -1.242995
5  1.070463 -1.303397  0.054561
6 -0.274731 -0.724751 -0.888987

In [24]:
df.fillna(0, inplace=True)

In [25]:
df

          0         1         2
0  1.951586  0.000000  0.000000
1 -1.679193  0.000000  0.000000
2  0.225144  0.000000 -1.313239
3  0.218700  0.000000 -1.078544
4 -0.988566 -0.101289 -1.242995
5  1.070463 -1.303397  0.054561
6 -0.274731 -0.724751 -0.888987

In [26]:
df = pd.DataFrame(np.random.randn(6, 3))

In [27]:
df.iloc[2:, 1] = NA

In [28]:
df.iloc[4:, 2] = NA

In [29]:
df

          0         1         2
0  1.414859 -0.308589 -1.383836
1  1.252503  0.342615  1.478454
2 -1.752622       NaN  1.141112
3 -0.248571       NaN  0.350836
4 -1.438128       NaN       NaN
5 -0.805024       NaN       NaN

In [30]:
df.fillna(method='ffill')

          0         1         2
0  1.414859 -0.308589 -1.383836
1  1.252503  0.342615  1.478454
2 -1.752622  0.342615  1.141112
3 -0.248571  0.342615  0.350836
4 -1.438128  0.342615  0.350836
5 -0.805024  0.342615  0.350836

In [31]:
 df.fillna(method='ffill', limit=2)

          0         1         2
0  1.414859 -0.308589 -1.383836
1  1.252503  0.342615  1.478454
2 -1.752622  0.342615  1.141112
3 -0.248571  0.342615  0.350836
4 -1.438128       NaN  0.350836
5 -0.805024       NaN  0.350836

In [32]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                  'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [33]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [34]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [35]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [36]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [37]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [38]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                               'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [39]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [40]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [41]:
lowercased = data['food'].str.lower()

In [42]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [43]:
data['animal'] = lowercased.map(meat_to_animal)

In [44]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [45]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [46]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [47]:
lowercased.map(meat_to_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [48]:
 data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [49]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [50]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [51]:
 data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [52]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [53]:
 data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [54]:
 data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                 index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [55]:
transform = lambda x: x[:4].upper()

In [56]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [57]:
data.index = data.index.map(transform)

In [58]:
 data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [59]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [60]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [61]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [62]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [63]:
 ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [64]:
bins = [18, 25, 35, 60, 100]

In [65]:
cats = pd.cut(ages, bins)

In [66]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [67]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [68]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [69]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [70]:
 pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [71]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [72]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [73]:
data = np.random.rand(20)

In [74]:
pd.cut(data, 4, precision=2)

[(0.079, 0.31], (0.53, 0.76], (0.76, 0.99], (0.31, 0.53], (0.76, 0.99], ..., (0.079, 0.31], (0.76, 0.99], (0.079, 0.31], (0.76, 0.99], (0.53, 0.76]]
Length: 20
Categories (4, interval[float64]): [(0.079, 0.31] < (0.31, 0.53] < (0.53, 0.76] < (0.76, 0.99]]

In [75]:
data = np.random.randn(1000)

In [76]:
cats = pd.qcut(data, 4)

In [77]:
cats

[(0.65, 2.71], (-2.8859999999999997, -0.702], (0.65, 2.71], (0.0193, 0.65], (0.65, 2.71], ..., (0.65, 2.71], (-2.8859999999999997, -0.702], (0.0193, 0.65], (0.0193, 0.65], (0.65, 2.71]]
Length: 1000
Categories (4, interval[float64]): [(-2.8859999999999997, -0.702] < (-0.702, 0.0193] < (0.0193, 0.65] < (0.65, 2.71]]

In [78]:
pd.value_counts(cats)

(0.65, 2.71]                     250
(0.0193, 0.65]                   250
(-0.702, 0.0193]                 250
(-2.8859999999999997, -0.702]    250
dtype: int64

In [79]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.0193, 1.238], (-1.346, 0.0193], (0.0193, 1.238], (0.0193, 1.238], (0.0193, 1.238], ..., (0.0193, 1.238], (-2.8859999999999997, -1.346], (0.0193, 1.238], (0.0193, 1.238], (1.238, 2.71]]
Length: 1000
Categories (4, interval[float64]): [(-2.8859999999999997, -1.346] < (-1.346, 0.0193] < (0.0193, 1.238] < (1.238, 2.71]]

In [80]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [81]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.011666     0.023353     0.000706    -0.020971
std       0.963796     0.976109     0.985243     0.988419
min      -2.829835    -3.481881    -3.056300    -3.268668
25%      -0.606714    -0.625038    -0.686357    -0.668621
50%      -0.007439     0.029014     0.018244    -0.015659
75%       0.648289     0.680883     0.645701     0.618142
max       3.906357     2.894760     3.849860     3.797169

In [82]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
4    3.906357  2.068978  0.662245  0.228871
361  0.169809 -3.143400 -0.967808 -0.350594
405 -0.414842 -1.061329 -0.752124  3.797169
501  0.371463  0.979388  0.856630 -3.268668
699  0.538589  0.070958 -3.056300  0.198173
723 -0.923207  0.433692  3.849860  0.889486
793  0.557596 -3.481881 -0.175946 -0.804599
864  3.251783 -0.867662  0.410974  1.492613

In [83]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [90]:
 data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.010508     0.023978    -0.000088    -0.021499
std       0.959732     0.974038     0.982108     0.984805
min      -2.829835    -3.000000    -3.000000    -3.000000
25%      -0.606714    -0.625038    -0.686357    -0.668621
50%      -0.007439     0.029014     0.018244    -0.015659
75%       0.648289     0.680883     0.645701     0.618142
max       3.000000     2.894760     3.000000     3.000000

In [85]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [86]:
sampler = np.random.permutation(5)

In [87]:
sampler

array([4, 1, 0, 2, 3])

In [88]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [89]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15

In [91]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11

In [92]:
choices = pd.Series([5, 7, -1, 6, 4])

In [93]:
draws = choices.sample(n=10, replace=True)

In [94]:
 draws

4    4
3    6
0    5
1    7
0    5
1    7
0    5
2   -1
0    5
3    6
dtype: int64

In [95]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                     'data1': range(6)})

In [96]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [97]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [98]:
df_with_dummy = df[['data1']].join(dummies)

In [99]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [100]:
mnames = ['movie_id', 'title', 'genres']

In [ ]:
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                      header=None, names=mnames)

In [ ]:
movies[:10]

In [ ]:
all_genres = []

In [ ]:
for x in movies.genres:
    all_genres.extend(x.split('|')

In [ ]:
genres = pd.unique(all_genres)

In [ ]:
genres

In [102]:
np.random.seed(12345)

In [103]:
values = np.random.rand(10)

In [104]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [105]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [106]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [107]:
val = 'a,b,  guido'

In [108]:
val.split(',')

['a', 'b', '  guido']

In [109]:
pieces = [x.strip() for x in val.split(',')]

In [110]:
pieces

['a', 'b', 'guido']

In [111]:
first, second, third = pieces

In [112]:
 first + '::' + second + '::' + third

'a::b::guido'

In [113]:
'::'.join(pieces)

'a::b::guido'

In [122]:
'guido' in val

True

In [115]:
val.index(',')

1

In [116]:
val.find(':')

-1

In [117]:
val.index(':')

ValueError: substring not found

In [118]:
val.count(',')

2

In [119]:
val.replace(',', '::')

'a::b::  guido'

In [120]:
val.replace(',', '')

'ab  guido'

In [121]:
import re

In [123]:
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [124]:
regex = re.compile('\s+')

In [125]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [126]:
regex.findall(text)

['    ', '\t ', '  \t']

In [128]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [129]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [130]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [131]:
m = regex.search(text)

In [132]:
m

In [133]:
text[m.start():m.end()]

'dave@google.com'

In [134]:
print(regex.match(text))

None

In [136]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [137]:
 pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [138]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [139]:
m = regex.match('wesm@bright.net')

In [140]:
m.groups()

('wesm', 'bright', 'net')

In [141]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [142]:
 data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
         'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [143]:
data = pd.Series(data)

In [144]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [145]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [146]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [147]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [148]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [149]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [150]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [151]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [152]:
 matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [153]:
 matches.str[:3]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [154]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [ ]:
#####数据规整